from telegram import ReplyKeyboardMarkup


main_menu = ReplyKeyboardMarkup(
    [
        ["👥 Клан", "📦 Склад"],
        ["🛰 Разведка", "⚔️ Рейды"],
        ["📊 Статистика", "⚙️ Настройки"],
    ],
    resize_keyboard=True
)


guest_menu = ReplyKeyboardMarkup(
    [
        ["📝 Подать заявку"]
    ],
    resize_keyboard=True
)

warehouse_menu = ReplyKeyboardMarkup(
    [
        ["📥 Пополнить склад", "📤 Списать со склада"],
        ["📦 Остатки склада", "⏳ Ожидает подтверждения"],
        ["📜 История склада"],
        ["⬅️ Назад"]
    ],
    resize_keyboard=True
)

warehouse_categories_menu = ReplyKeyboardMarkup(
    [
        ["🪨 Ресурсы", "⚙️ Компоненты"],
        ["🔫 Оружие", "💣 Боеприпасы"],
        ["🛡 Броня", "🛠 Инструменты"],
        ["⬅️ Назад"]
    ],
    resize_keyboard=True
)

weapons_menu = ReplyKeyboardMarkup(
    [
        ["🔫 Револьвер", "🔫 Кустарный пистолет"],
        ["🔫 Desert Eagle", "🔫 Дробовик"],
        ["🔫 Охотничья винтовка", "🔫 Полуавтоматическая винтовка"],
        ["🔫 Штурмовая винтовка", "🔫 Пистолет-пулемёт"],
        ["🔫 Сигнальный пистолет", "🔫 Томпсон"],
        ["🔫 W94", "🔫 B51"],
        ["🏹 Деревянный лук", "🏹 Арбалет"],
        ["⬅️ К категориям"]
    ],
    resize_keyboard=True
)


ammo_menu = ReplyKeyboardMarkup(
    [
        ["🏹 Стрела", "🏹 Болт"],
        ["🔫 Пистолетный патрон", "🔫 5.56 винтовочный патрон"],
        ["🔫 Самодельный патрон", "🔫 Картечь 12 калибра"],
        ["⚪ Стальной шарик"],
        ["⬅️ К категориям"]
    ],
    resize_keyboard=True
)


armor_menu = ReplyKeyboardMarkup(
    [
        ["🪖 Деревянный шлем", "🪖 Костяной шлем"],
        ["🪖 Кожаный шлем", "🪖 Металлический шлем"],
        ["🦺 Деревянный нагрудник", "🦺 Костяной нагрудник"],
        ["🦺 Кожаный нагрудник", "🦺 Металлический нагрудник"],
        ["👖 Деревянная защита ног", "👖 Костяная защита ног"],
        ["👖 Кожаная защита ног", "👖 Металлическая защита ног"],
        ["👢 Деревянные сандалии", "👢 Костяная обувь"],
        ["👢 Кожаные сапоги", "👢 Металлические ботинки"],
        ["☢️ Антирадиационный костюм"],
        ["⬅️ К категориям"]
    ],
    resize_keyboard=True
)


tools_menu = ReplyKeyboardMarkup(
    [
        ["🪓 Каменный топор", "🪓 Топор"],
        ["⛏ Кирка", "🔥 Факел"],
        ["⛏ Камнекрушитель", "🪚 Пила-потрошитель"],
        ["🪚 Бензопила", "⛏ Бур"],
        ["⬅️ К категориям"]
    ],
    resize_keyboard=True
)
resources_menu = ReplyKeyboardMarkup(
    [
        ["🪵 Древесина", "🪨 Камень"],
        ["⚫ Уголь", "🟡 Сера"],
        ["🔩 Металлические фрагменты", "⬛ МВК"],
        ["⚙️ Металлолом"],
        ["🦴 Кость", "🧥 Кожа"],
        ["🧴 Животный жир", "🧶 Ткань"],
        ["⬅️ К категориям"]
    ],
    resize_keyboard=True
)


components_menu = ReplyKeyboardMarkup(
    [
        ["🪢 Верёвка", "⛽ Топливо"],
        ["💥 Порох", "⚙️ Шестерни"],
        ["🔧 Металлическая труба", "🌀 Металлическая пружина"],
        ["🪡 Швейный набор"],
        ["⬅️ К категориям"]
    ],
    resize_keyboard=True
)

clan_menu = ReplyKeyboardMarkup(
    [
        ["👤 Мой профиль", "📋 Список участников"],
        ["🎖 Изменить роль", "❌ Исключить участника"],
        ["📢 Рассылка клану", "📜 Журнал клана"],
        ["👑 Передать лидерство"],
        ["⬅️ Назад"],
    ],
    resize_keyboard=True
)


raid_menu = ReplyKeyboardMarkup(
    [
        ["💣 Калькулятор рейда"],
        ["🧱 Каменная стена", "🚪 Железная дверь"],
        ["🏠 Шкаф", "🪟 Люк"],
        ["⬅️ Назад"],
    ],
    resize_keyboard=True
)